{"data":{"allStrapiJobs":{"nodes":[{"date":"Aug 2019 - Present","company":"Intuit - Senior SWE","desc":[{"id":8,"name":"Owner of multiple features and pages for Quickbooks Payroll"},{"id":9,"name":"UI Automation for complex customer facing pages"},{"id":10,"name":"Mentor and Software engineering interviewer"},{"id":11,"name":"Performance tracking and analysis "}],"strapiId":5,"position":"Senior Software Engineer"},{"date":"July 2017 - July 2019","company":"Intuit - SWE 2","desc":[{"id":6,"name":"Developed a new homepage for Intuit's Ecosystem Payroll product with React, Apollo, and GraphQL."},{"id":7,"name":"Worked on a new product line that enables customers to use Intuit Payroll product within the QBO ecosystem without accounting features."}],"strapiId":4,"position":"Software Engineer 2"},{"date":"Jun 2016 - Jun 2017","company":"Intuit - SWE 1","desc":[{"id":5,"name":"I have worked as a front end engineer that mainly developed new features for a payroll product that is used globally. Work includes developing, testing, and maintaining a relatively new product built with React, Apollo, Relay, and GraphQL."}],"strapiId":3,"position":"Software Engineer 1"},{"date":"Jun 2015 - Sep 2015","company":"Intuit - Intern","desc":[{"id":2,"name":"During the internship, I worked with the Central Technology Development internal tools team on developing a test automation framework for small product teams. First part of the internship (~2 weeks) was spent on learning corporate tools and technology for preparation."},{"id":3,"name":"As for the rest of the internship (~12 weeks), I joined the internal tools team and worked on stories for the new automated testing framework. In the beginning my stories were mostly backlogs such as providing unit testing to the existing modules to improve code coverage and adding proper documentation to the modules as most of them didn't have documentation. My goal was to have robust documentation to make sure that all the users of our framework would be able to access and be able to apply any module within 10 minutes. Afterwards I was put in charge of updating and releasing the next version of the framework. In the final part of my internship I worked on fixing bugs and adding my own modules and examples to the framework."},{"id":4,"name":"Some of the main skills that I learned from this internship is agile development, version control, test automation, behavioral testing, QA, customer oriented development, version distribution."}],"strapiId":2,"position":"Software Engineer Intern"},{"date":"Sep 2014 - Jun 2015","company":"SLO Mission High School","desc":[{"id":1,"name":"I am a one on one bilingual tutor for high school Chinese exchange students. I was responsible for tutoring high school level physics, calculus, literature, and biology."}],"strapiId":1,"position":"Bilingual Tutor"}]}}}